; b - c + a with double registers

org  0x100               ; Вказуємо, що це програма .COM
section .data
    a db 10               ; Визначаємо a = 5
    b db 5               ; Визначаємо b = 3
    c db 3               ; Визначаємо c = 2
    resultMsg db 'Result: $' ; Визначення рядка для виведення результату

section .text
_start:
    mov al, [b]          ; Завантажуємо b в al
    sub al, [c]          ; віднімаємо с до al
    add al, [a]          ; додаємо c від al

    ; Виведення повідомлення
    mov ah, 09h          ; Функція DOS для виведення рядка
    lea dx, resultMsg    ; Встановлюємо DX на адресу resultMsg
    int 21h             ; Виклик DOS-переривання

    ;----------
    ; Перетворення AL у десятки та одиниці

    mov ah, 0           ; Очищаємо AH перед діленням
    mov bl, 10          ; Ділимо на 10
    div bl              ; AL - десятки, AH - одиниці

    ; -----------------
    ; виведення десяток

    add al, '0'          ;  перетворюємо десятки в ASCII
    mov dl, al           ;  АТИ — копіюємо десятки в DL
    mov ah, 02h          ;  DOS-функція для виводу символу
    int 21h              ;  ДОДАТИ — виводимо десятки   

    ;-------------------
    ; Виведення одиниць

    mov al, ah
    add al, '0'
    mov dl, al
    mov ah, 02h
    int 21h

    ; --------- 
    ; Завершення програми

    ; Очікування натискання клавіші
    mov ah, 0
    int 16h
    
    mov ax, 4c00h        ; Функція DOS для завершення програми
    int 21h              ; Виклик DOS-переривання